src/DataProcessors/СопоставлениеСкидокСуперМаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СопоставлениеСкидокСуперМаг</Name>
			<Comment>Сопоставление скидок Супер маг</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СоответствиеСкидокВОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеСкидокВОборудовании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/СопоставлениеСкидокСуперМаг/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьТипыСкидок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаСкидок.Идентификатор,
	|	ТаблицаСкидок.Наименование,
	|	ТаблицаСкидок.НачалоДействия,
	|	ТаблицаСкидок.КонецДействия,
	|	ТаблицаСкидок.НачВремя,
	|	ТаблицаСкидок.КонВремя,
	|	ТаблицаСкидок.ДниНедели
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	&ТаблицаСкидок КАК ТаблицаСкидок
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаСкидок.Идентификатор,
	|	ТаблицаСкидок.Наименование,
	|	ТаблицаСкидок.НачалоДействия,
	|	ТаблицаСкидок.КонецДействия,
	|	ТаблицаСкидок.НачВремя,
	|	ТаблицаСкидок.КонВремя,
	|	ТаблицаСкидок.ДниНедели,
	|	СкидкиВОборудовании.Скидка КАК Скидка
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеСкидокВОборудовании КАК СкидкиВОборудовании
	|ПО
	|	ТаблицаСкидок.Идентификатор = СкидкиВОборудовании.Идентификатор
	|";
	
	Запрос.УстановитьПараметр("ТаблицаСкидок", ТаблицаСкидок.Выгрузить());
	ТаблицаСкидок.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСкидки(Команда)
	
	ТаблицаСкидок.Очистить();
	
	ОписаниеОшибки = "";
	
	Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(
		УникальныйИдентификатор,
		ПодключаемоеОборудование,
		ОписаниеОшибки
	);
	
	Если НЕ Результат Тогда
		ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
		|%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	// Поиск подключенного устройства.
	ПодключенноеУстройство = МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, ПодключаемоеОборудование);
	
	Если ПодключенноеУстройство = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Устройство не подключено. Перед выполнением операции устройство должно быть подключено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БазаТерминала) Тогда
		СтрокаУКМ = ОфлайнОборудованиеPOSСуперМАГКлиентСервер.ПолучитьСтрокуПодключения(ПодключенноеУстройство.Параметры, БазаТерминала);
	Иначе
		СтрокаУКМ = ОфлайнОборудованиеPOSСуперМАГКлиентСервер.ПолучитьСтрокуПодключения(ПодключенноеУстройство.Параметры, ПодключенноеУстройство.Параметры.БазаТерминала);
	КонецЕсли;
	
	БД = Новый COMОбъект("ADODB.Connection");
	Попытка
		БД.ConnectionString = СтрокаУКМ;
		БД.Open();
		ПодключениеОткрыто = Истина;
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка соединения с БД по причине: %1%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1%", ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
		
	Запрос=Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation=3;
	Состояние("Получение талицы скидок в УКМ");
	Попытка
		Запрос.Open("SELECT 
		|	*
		|FROM
		|	`trm_in_discount_types`
		|WHERE
		|	`deleted`=0
		|ORDER BY
		|	id",БД,2,3,1);
	Исключение 
		Сообщить("Ошибка выполнения запроса по причине: "+ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
		БД.Close();
		Возврат;
	КонецПопытки;
	
	ПоследнийИД = 0;
	
	Пока НЕ Запрос.EOF Цикл
		
		ДниНедели = Формат(Запрос.Fields("monday").Value, "ЧН=0");
		ДниНедели = ДниНедели + Формат(Запрос.Fields("tuesday").Value, "ЧН=0");
		ДниНедели = ДниНедели + Формат(Запрос.Fields("wednesday").Value, "ЧН=0");
		ДниНедели = ДниНедели + Формат(Запрос.Fields("thursday").Value, "ЧН=0");
		ДниНедели = ДниНедели + Формат(Запрос.Fields("friday").Value, "ЧН=0");
		ДниНедели = ДниНедели + Формат(Запрос.Fields("saturday").Value, "ЧН=0");
		ДниНедели = ДниНедели + Формат(Запрос.Fields("sunday").Value, "ЧН=0");
		
		НоваяСтрока = ТаблицаСкидок.Добавить();
		НоваяСтрока.Идентификатор  = Запрос.Fields("id").Value;
		НоваяСтрока.Наименование   = Запрос.Fields("name").Value;
		НоваяСтрока.НачалоДействия = Запрос.Fields("date_from").Value;
		НоваяСтрока.КонецДействия  = Запрос.Fields("date_to").Value;
		НоваяСтрока.ДниНедели      = ДниНедели;
		
		НачВремя = Запрос.Fields("time_from").Value;
		Если НЕ НачВремя = Null Тогда
			Если СтрДлина(НачВремя) = 3 Тогда
				НачВремя = Дата("00010101" + СтрЗаменить(НачВремя, ":", "")+"0000");
			ИначеЕсли СтрДлина(НачВремя) = 5 Тогда
				НачВремя = Дата("00010101" + СтрЗаменить(НачВремя, ":", "")+"00");
			Иначе
				НачВремя = Дата("00010101" + СтрЗаменить(НачВремя, ":", ""));
			КонецЕсли;
			НоваяСтрока.НачВремя = НачВремя;
		КонецЕсли;
		
		КонВремя = Запрос.Fields("time_to").Value;
		Если НЕ КонВремя = Null Тогда
			Если СтрДлина(КонВремя) = 3 Тогда
				КонВремя = Дата("00010101" + СтрЗаменить(КонВремя, ":", "")+"0000");
			ИначеЕсли СтрДлина(КонВремя) = 5 Тогда
				КонВремя = Дата("00010101" + СтрЗаменить(КонВремя, ":", "")+"00");
			Иначе
				КонВремя = Дата("00010101" + СтрЗаменить(КонВремя, ":", ""));
			КонецЕсли;
			НоваяСтрока.КонВремя = КонВремя;
		КонецЕсли;
		
		Запрос.MoveNext();
	КонецЦикла;
	Запрос.Close();
	БД.Close();
	
	ЗаполнитьТипыСкидок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаСкидок.Идентификатор,
	|	ТаблицаСкидок.Наименование,
	|	ВЫРАЗИТЬ(ТаблицаСкидок.Скидка КАК Справочник.ТипыСкидок) КАК Скидка
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	&ТаблицаСкидок КАК ТаблицаСкидок
	|ГДЕ
	|	(НЕ ТаблицаСкидок.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка))
	|;
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаСкидок.Идентификатор, СкидкиВОборудовании.Идентификатор) КАК Идентификатор,
	|	ЕСТЬNULL(ТаблицаСкидок.Наименование, СкидкиВОборудовании.Наименование) КАК Наименование,
	|	ЕСТЬNULL(ТаблицаСкидок.Скидка, СкидкиВОборудовании.Скидка) КАК Скидка,
	|	ВЫБОР
	|		КОГДА СкидкиВОборудовании.Скидка ЕСТЬ NULL ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК Добавить,
	|	ВЫБОР
	|		КОГДА ТаблицаСкидок.Идентификатор ЕСТЬ NULL ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК Удалить
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеСкидокВОборудовании КАК СкидкиВОборудовании
	|ПО
	|	ТаблицаСкидок.Идентификатор = СкидкиВОборудовании.Идентификатор И 
	|	ТаблицаСкидок.Наименование  = СкидкиВОборудовании.Наименование И 
	|	ТаблицаСкидок.Скидка        = СкидкиВОборудовании.Скидка
	|ГДЕ
	|	(СкидкиВОборудовании.Идентификатор ЕСТЬ NULL) ИЛИ 
	|	(ТаблицаСкидок.Идентификатор ЕСТЬ NULL)
	|";
	
	Запрос.УстановитьПараметр("ТаблицаСкидок", ТаблицаСкидок.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Добавить = Истина Тогда
			МенеджерЗаписиСкидки = РегистрыСведений.СоответствиеСкидокВОборудовании.СоздатьМенеджерЗаписи();
			МенеджерЗаписиСкидки.Идентификатор = Выборка.Идентификатор;
			МенеджерЗаписиСкидки.Скидка        = Выборка.Скидка;
			МенеджерЗаписиСкидки.Наименование  = Выборка.Наименование;
			МенеджерЗаписиСкидки.Записать(Истина);
		ИначеЕсли Выборка.Удалить Тогда
			МенеджерЗаписиСкидки = РегистрыСведений.СоответствиеСкидокВОборудовании.СоздатьМенеджерЗаписи();
			МенеджерЗаписиСкидки.Идентификатор = Выборка.Идентификатор;
			МенеджерЗаписиСкидки.Скидка        = Выборка.Скидка;
			МенеджерЗаписиСкидки.Прочитать();
			Если МенеджерЗаписиСкидки.Выбран() Тогда
				МенеджерЗаписиСкидки.Удалить();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСоответствия(Команда)
	
	ЗаписатьСоответствияНаСервере();
	Оповестить("Запись_СопоставленияСкидок");
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Идентификатор") Тогда
		ПодключаемоеОборудование = Параметры.Идентификатор;
	КонецЕсли;
	
	Если Параметры.Свойство("БазаТерминала") Тогда
		БазаТерминала = Параметры.БазаТерминала;
	КонецЕсли;
	
КонецПроцедуры
